{"keras_version": "2.0.3", "config": [{"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "name": "conv2d_4", "use_bias": true, "kernel_constraint": null, "filters": 64, "kernel_size": [10, 10], "strides": [1, 1], "bias_regularizer": null, "activation": "relu", "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "batch_input_shape": [null, 100, 100, 3], "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_4", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.4, "trainable": true, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "name": "conv2d_5", "use_bias": true, "filters": 64, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [10, 10], "padding": "valid", "bias_regularizer": null, "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_5", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.4, "trainable": true, "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "name": "conv2d_6", "use_bias": true, "filters": 32, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [10, 10], "padding": "valid", "bias_regularizer": null, "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_6", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.4, "trainable": true, "name": "dropout_6"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_4", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "activation": "relu", "kernel_regularizer": null, "bias_constraint": null, "units": 150}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_5", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "activation": "relu", "kernel_regularizer": null, "bias_constraint": null, "units": 50}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_6", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "activation": "softmax", "kernel_regularizer": null, "bias_constraint": null, "units": 21}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}