{"config": [{"config": {"kernel_size": [10, 10], "batch_input_shape": [null, 100, 100, 3], "padding": "valid", "strides": [1, 1], "use_bias": true, "bias_regularizer": null, "name": "conv2d_2", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "filters": 100, "data_format": "channels_last", "dtype": "float32"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "rate": 0.4, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"use_bias": true, "bias_regularizer": null, "name": "dense_3", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "units": 50, "kernel_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"use_bias": true, "bias_regularizer": null, "name": "dense_4", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "units": 21, "kernel_regularizer": null, "activation": "softmax"}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.3"}